app/controllers/messages_controller.rb

SELECT * FROM "messages"
---
  def index
    @messages = Message.all

SELECT * FROM "messages" WHERE ("messages"."id" = 6)
---
  def edit
    @message = Message.find(params[:id])

INSERT INTO "messages" ("SmsMessageSid", "AccountSid", "updated_at", "Body", "From", "To", "created_at") VALUES(NULL, NULL, '2010-05-05 22:21:17', NULL, NULL, NULL, '2010-05-05 22:21:17')
---
  def create
    @message = Message.new(params[:message])

    # Create a Twilio REST account object using your Twilio account ID and token
    account = Twilio::RestAccount.new(ACCOUNT_SID, ACCOUNT_TOKEN)

    d = { 'From' => @message.From, 'To' => @message.To, 'Body' => @message.Body }

    resp = account.request("/#{API_VERSION}/Accounts/#{ACCOUNT_SID}/SMS/Messages", 'POST', d)
    resp.error! unless resp.kind_of? Net::HTTPSuccess
    puts "code: %s\nbody: %s" % [resp.code, resp.body]

    respond_to do |format|
      if @message.save

SELECT * FROM "messages" WHERE ("messages"."id" = 9)
UPDATE "messages" SET "SmsMessageSid" = '22334455667788', "updated_at" = '2010-05-12 13:03:24' WHERE "id" = 10
---
  def update
    @message = Message.find(params[:id])

    respond_to do |format|
      if @message.update_attributes(params[:message])

INSERT INTO "messages" ("SmsMessageSid", "AccountSid", "updated_at", "Body", "From", "To", "created_at") VALUES('SMc069eb9a19706aa81ed5e6ce76c25999', 'AC8eddd770e69ad61de3fef0b4671bd000', '2010-05-12 15:14:52', 'hello', '5556667777', '4155551212', '2010-05-12 15:14:52')
---
  def twilio_create
    @message = Message.new(:SmsMessageSid => params[:SmsMessageSid], :AccountSid => params[:AccountSid], :Body => params[:Body], :From => params[:From], :To =>params[:To])

    respond_to do |format|
      if @message.save